app/controllers/items_controller.rb

  def index
      if !logged_in?
           @active_items = Item.active.paginate(:page => params[:page]).per_page(10)
---
SELECT "items".* FROM "items"  WHERE "items"."active" = 't'